
Super Duper Config
-----------------
** Expand to full screen on startup
   #+BEGIN_SRC emacs-lisp
     ;; start the initial frame maximized
     ;; (add-to-list 'initial-frame-alist '(fullscreen . maximized))
   #+END_SRC

   #+RESULTS:
   : ((fullscreen . maximized))

** Exec Paths
   #+begin_src emacs-lisp
     ;; (add-to-list 'exec-path "/usr/local/bin")
     ;; (add-to-list 'exec-path "/home/k8s/.fzf/bin")
     ;; (add-to-list 'exec-path "/usr/bin")
      (setq exec-path (append exec-path '("/home/k8s/.fzf/bin")))
      (setenv "PATH" (concat (getenv "PATH") ":/home/k8s/.fzf/bin"))

   #+end_src

   #+RESULTS:
   : /home/k8s/.local/bin:/usr/local/sbin:/usr/local/bin:/usr/sbin:/usr/bin:/sbin:/bin:/usr/games:/usr/local/games:/snap/bin:/home/k8s/.fzf/bin

